{"id":"680e32bb-996c-446b-851c-421e3ec768b3","name":"Qlik Admin Playbook: Monthly","author":"fruityhost","sections":[{"name":"Analyze Data Connections","checks":[{"title":"Analyze Data Connections","description":"Check if there are duplicate, no longer used data connections, those that have never been in use, and most widely used. Learn more on https://adminplaybook.qlik-poc.com/docs/asset_management/data_connections/analyze_data_connections.html#what-are-the-most-widely-used-data-connections"},{"title":"Remove Unused Data Connections","description":"Removing unused connections on a regular basis decreases clutter, improves performance, and creates a better user experience. The goal of this section is to leave only the data connections that are necessary for analysis. Learn more on https://adminplaybook.qlik-poc.com/docs/asset_management/data_connections/remove_unused_data_connections.html"}],"qsda":false},{"name":"Analyze Security Rules","checks":[{"title":"Increase Readability","description":"When writing a security rule, try to break up the formatting into multiple lines, to make the rule more easily digested by a human being. Learn more on https://adminplaybook.qlik-poc.com/docs/asset_management/security_rules/analyze_security_rules.html"},{"title":"Increase Scalability","description":"When writing a rule, one must ensure that it can scale. While ((user.name=\"Rodion Raskolnikov\") or (user.name=\"Sofya Marmeladova\")) works for a couple of users, as more and more users come into the system, that 1:1 rule style quickly becomes very difficult to maintain. Instead, groups should be used, as in ((resource.@Department=user.group)."},{"title":"Increase Performance","description":"If there are thousands of potential values in the custom property field, this will significantly increase evaluation times. Be as specific as possible–more filtered results will perform better (the lower the grain, the better). Use only the required context and minimize the number of custom property values."}],"qsda":false},{"name":"License Maintenance ","checks":[{"title":"Remove License Allocations for Inactive Users","description":"A user is marked inactive when a configured User Directory Connector (UDC) can no longer can find the user in the 3rd party user directory (AD, LDAP etc…). Such users are candidates for license dealloaction if they have left the company or moved to a department or group that no longer has access–the latter comes into play when there is an LDAP filter on the UDC."},{"title":"Check for License Denials","description":"From the License Monitoring app look up for users who have been denied access. These users are candidates for being allocated a new license. Depending on what is found out about the user in QMC, the follow-up action is either to simply allocate a license to the single user, or to update the licence allocation rules from the License Management section of the QMC. Learn more on https://adminplaybook.qlik-poc.com/docs/licensing/license_maintenance.html#check-for-license-denials"}],"qsda":false},{"name":"Remove/Disable Unused Tasks","checks":[{"title":"“Manually triggered reload of…“ tasks","description":"These tasks should always be routinely cleaned out, as they are created to run once and then typically left to live out their long and lonely lives to never be run again. These are “one-off” tasks that are created and triggered by the Reload now option under the Apps section in the QMC when selecting a single application."},{"title":"Disabled tasks","description":"Contact the Owner of the application for which the task is associated with, as well as potentially the Modified by user of the task, who is more than likely the user who disabled the task. This information can all be found in the QMC."},{"title":"Active tasks with no Next execution","description":"Contact the Owner of the application for which the task is associated with, as well as potentially the Modified by user of the task, who is more than likely the user who disabled the task. This information can all be found in the QMC."}],"qsda":false},{"name":"Remove Unused Streams","checks":[{"title":"Manually Check Published Apps for Each Stream","description":"This process should be repeated for each Stream to find unused streams. Check on the validity of the streams and to remove those that are deemed unnecessary. "}],"qsda":false},{"name":"Review Disk Space","checks":[{"title":"Enumerate Storage Used by a Qlik Sense Cluster","description":"Check for Storage used for Data Connections, Storage used for Qlik Sense storage, Local storage for each Qlik Sense node. After completing each step, the administrator will have an enumerated list of storage dependencies for the Qlik Sense cluster. The percentage in a location for reference on the following month will allow the administrator to build out projections for the storage needs over the next 6-24 months. Learn more on https://adminplaybook.qlik-poc.com/docs/system_planning/review_disk_space.html#storage-used-for-qlik-sense-storage"}],"qsda":false},{"name":"Backup&Archiving","checks":[{"title":"Verify/Execute Backups","description":"Verify that appropriate backups of their Qlik Sense Enterprise deployment have been made. Learn more on https://adminplaybook.qlik-poc.com/docs/backup_and_archiving/verify_backup_execution.html#what-do-i-backup"}],"qsda":false}]}