{"id":"8767197b-64d4-444a-9c27-a106dcac3e61","name":"Qlik Admin Playbook: Weekly","author":"fruityhost","sections":[{"name":"Apps","checks":[{"title":"Check for New Apps","description":"Review any new applications to increase reaction times to the presence of new applications. This step can be done either from QMC (Apps -> Filter by date created and size) or from Operations Monitor. Learn more on https://adminplaybook.qlik-poc.com/docs/asset_management/apps/check_new_apps.html"},{"title":"Analyze App Metadata Analyzer","description":"Gain insights into the composition of all data models across an entire Qlik site and visibility into what apps have synthetic keys, data islands, and circular references.   Analyze what fields could be dropped/optimized by clearly displaying their size/proportion of the application.   Apply thresholds at the application level such as: total records, total number of fields, total number of tables, disk size, etc –  to employ gating-like mechanisms to ensure data modeling standards and best practices across the site.   Learn more on https://adminplaybook.qlik-poc.com/docs/asset_management/apps/analyze_app_metadata_analyzer.html"}],"qsda":false},{"name":"Tasks","checks":[{"title":"Check for New Tasks","description":"Curate what is necessary (cadence, duplicates, etc), to encourage reviews of batch windows, task concurrencies, and any other implications against the Qlik schedulers. The above may influence architectural patterns and dictate the need for reload task pinning. Check for new tasks from either QMC (Tasks -> Filter by date) or from Operations Monitor. Learn more on https://adminplaybook.qlik-poc.com/docs/asset_management/tasks/new_tasks.html"},{"title":"Analyze Tasks","description":"Analyze what apps have duplicative reload tasks. Review what tasks have a high Failure rate in Operations Monitor (Task Details). Disable the tasks with 100% failure rate and alert the app owner. For apps which fail at a modest rate, explore further in the Task Details sheet as to whether there are patterns (e.g. time of the day) which are correlated. Learn more on https://adminplaybook.qlik-poc.com/docs/asset_management/tasks/analyze_tasks.html#optimize-concurrency"}],"qsda":false},{"name":"Custom Properties","checks":[{"title":"Check for New/Modified Custom Properties","description":"Discover new/modified custom properties so that their usage can be identified and tracked. Regulate the amount of custom property value options, as there can be performance impacts if there are many.  Identify whether individual custom properties are being leveraged for security rules or for management/automation purposes. Learn more on https://adminplaybook.qlik-poc.com/docs/asset_management/custom_properties/custom_properties.html"}],"qsda":false},{"name":"Data Connections","checks":[{"title":"Check for New Data Connections","description":"Curb the amount of connections that exist in the environment. It allows for the ability to spot duplicates ahead of time, track what sources are being used, and catch any potential out-of-process additions. Learn more on https://adminplaybook.qlik-poc.com/docs/asset_management/data_connections/check_new_data_connections.html"}],"qsda":false},{"name":"Security Rules","checks":[{"title":"Check for New/Modified Security Rules","description":"Ensure the right people have access to the appropriate resources, and have the appropriate privileges to act on those resources. Important to see if new rules are being created, and to check rules that have recently been modified. Learn more on https://adminplaybook.qlik-poc.com/docs/asset_management/security_rules/check_security_rules.html"}],"qsda":false},{"name":"Streams","checks":[{"title":"Check for New Streams","description":"If streams are being created regularly, it is a potential sign that the way assets are organized might not be optimal, or potentially that users/LOBs’ are trying to go around a certain process. Ideally, very few individuals should have the right to create streams, so it is an important thing to keep an eye on to ensure nothing is out of the ordinary. Learn more on https://adminplaybook.qlik-poc.com/docs/asset_management/streams/check_new_streams.html"}],"qsda":false},{"name":"Licensing","checks":[{"title":"Review License Allocations","description":"Evaluate license growth and needs using the built in License Monitor application. Check for License Growth to see how many total licenses are available for Professional and Analyzer users and keep track of the period in which the licensed will max out. Learn more on https://adminplaybook.qlik-poc.com/docs/licensing/review_license_allocations.html"}],"qsda":false}]}