{"id":"d0687ee5-9772-4743-9c6d-f724f9950e81","name":"Default checklist","author":"motiodev","sections":[{"name":"Data Model Checklist","checks":[{"title":"Synthetic Keys removed","description":"See https://help.qlik.com/en-US/sense/April2020/Subsystems/Hub/Content/Sense_Hub/Scripting/synthetic-keys.htm?tr=ru-RU for more information on Synthetic Keys."},{"title":"Circular references removed from the data model","description":"See https://help.qlik.com/en-US/sense/April2020/Subsystems/Hub/Content/Sense_Hub/LoadData/understand-circular-references.htm for more information on Circular references."},{"title":"Timestamps removed or decoupled from date field","description":"To reduce unique records in a field, it is recommended to separate the timestamps from the date fields.\nIf there are no timestamps in the analysis, then you can get rid of them using the formula `Date(Floor(YourDateField))`.\nIf you want to keep the timestamps in the model, you can remove the time to store only the date in one field, and store the time in another field using the formula `Time(Frac(Timestamp#(YourDateField,'MM/DD/YYYY h:mm:ss TT ')))`."},{"title":"Data islands avoided","description":"Unlinked tables can be useful, but they can have a huge impact on the application performance. Try replacing islands with variables if you are using islands for the sample."}],"qsda":false},{"name":"Interface Checklist","checks":[{"title":"Minimum number of AGGR function uses","description":"See https://community.qlik.com/t5/Qlik-Design-Blog/When-should-the-Aggr-function-NOT-be-used/ba-p/1467855"},{"title":"Comparison of string values is avoided where possible","description":"String comparison is not as efficient as set analysis.\nFormulas: `Match()`, `MixMatch()`, `WildMatch`, `Pick`, etc.\nUse them only when necessary, such as in a load script as part of a `WHERE` clause.\nAvoid them in the frontend where possible and create flags in your data load script or use set analysis instead."},{"title":"Calculation conditions are used for visualization objects that display or process a large number of lines","description":"Typically, Qlik Sense has visualizations that are able to display many records (such as tables).\nTo avoid the possibility of creating large hypercubes, it is recommended that you add calculation conditions to objects so that they only appear after certain selections have been made, thereby rendering less data.\nAn example of this would be using functions like `GetSelectedCount([Country]) = 1 OR GetPossibleCount([Country]) = 1`.\nIn this scenario, the user have to select one country when the visualization is available to the user."}],"qsda":false},{"name":"QSDA Pro performance check-up","checks":[],"qsda":true}]}